Revit 2026 API

# ConcreteConcreteFinish Property

---

The property labeled "Type" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string ConcreteFinish { get; }
```
```vb
Public Shared ReadOnly Property ConcreteFinish As String
	Get
```
```cpp
public:
static property String^ ConcreteFinish {
	String^ get ();
}
```
```fsharp
static member ConcreteFinish : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteFinishType".

#### Reference

Concrete Class

Autodesk.Revit.DB.Visual Namespace